{"format": "layers-model", "generatedBy": "keras-js", "convertedBy": "TensorFlow.js Converter", "modelTopology": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 38, "activation": "softmax", "use_bias": true}}]}, "keras_version": "2.12.0", "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [150528, 38], "dtype": "float32"}, {"name": "dense/bias", "shape": [38], "dtype": "float32"}]}]}